src_ext/Documents/УЗ_ПереводУченика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПереводУченика</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_ГруппыОбучения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УЗ_СоставГрупп</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИз</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВ</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>150</v8:Length>
					</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
							<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_СоставГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_СоставГрупп</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Состоит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_ПереводУченика/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//новый документ — с начала сегодняшнего дня (перевод действует с дня)
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Элементы.Организация.Видимость = УЗ_Общий.ЕстьОрганизации();
	ОбновитьПредпросмотрНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УЗ_ДатыЗапрета.ФормаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПредпросмотрНаСервере();
КонецПроцедуры

//Карточка ученика и группа показывают состав — после записи перевода перечитывают его.
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("УЗ_ПереводУченика", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьПредпросмотрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаИзПриИзменении(Элемент)
	ОбновитьПредпросмотрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаВПриИзменении(Элемент)
	ОбновитьПредпросмотрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УченикиПриИзменении(Элемент)
	ОбновитьПредпросмотрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УченикиПослеУдаления(Элемент)
	ОбновитьПредпросмотрНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИзГруппы(Команда)

	Если Не ЗначениеЗаполнено(Объект.ГруппаИз) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Выберите «Из группы» — список заполнится её учениками на дату документа'"), "Объект.ГруппаИз");
		Возврат;
	КонецЕсли;
	ЗаполнитьИзГруппыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредпросмотр(Команда)
	ОбновитьПредпросмотрНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Ученики группы «Из группы» на дату документа (состав — регистр УЗ_СоставГрупп): кого ещё нет в списке.
&НаСервере
Процедура ЗаполнитьИзГруппыНаСервере()

	Для Каждого Ученик Из РегистрыСведений.УЗ_СоставГрупп.СоставГруппыНаДату(Объект.ГруппаИз, Объект.Дата) Цикл
		Если Объект.Ученики.НайтиСтроки(Новый Структура("Ученик", Ученик)).Количество() = 0 Тогда
			Объект.Ученики.Добавить().Ученик = Ученик;
		КонецЕсли;
	КонецЦикла;
	ОбновитьПредпросмотрНаСервере();

КонецПроцедуры

//«Что произойдёт»: тот же план, что выполнит проведение (Документы.УЗ_ПереводУченика.Предпросмотр) — уроки-планы,
//из которых ученики уйдут и в которые добавятся; причины отказа — красным (цвет минуса палитры), без окон.
&НаСервере
Процедура ОбновитьПредпросмотрНаСервере()

	Убрать.Очистить();
	Добавить.Очистить();
	Если Объект.Ученики.Количество() = 0 Тогда
		СостояниеПлана = НСтр("ru = 'Добавьте учеников — здесь появятся уроки-планы, которые изменит перевод'");
		Элементы.СостояниеПлана.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветПояснения();
		Возврат;
	КонецЕсли;
	Итог = Документы.УЗ_ПереводУченика.Предпросмотр(РеквизитФормыВЗначение("Объект"));
	Для Каждого СтрокаПлана Из Итог.Убрать Цикл
		ЗаполнитьЗначенияСвойств(Убрать.Добавить(), СтрокаПлана);
	КонецЦикла;
	Для Каждого СтрокаПлана Из Итог.Добавить Цикл
		ЗаполнитьЗначенияСвойств(Добавить.Добавить(), СтрокаПлана);
	КонецЦикла;
	Если Итог.Ошибки.Количество() > 0 Тогда
		СостояниеПлана = НСтр("ru = 'Провести нельзя: '") + СтрСоединить(Итог.Ошибки, "; ");
		Элементы.СостояниеПлана.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветМинусаДенег();
		Возврат;
	КонецЕсли;
	Части = Новый Массив;
	Если Убрать.Количество() = 0 И Добавить.Количество() = 0 И Объект.Проведен Тогда
		Части.Добавить(
			НСтр("ru = 'Перевод проведён: состав групп и уроки-планы уже изменены. Отмена проведения вернёт их'"));
	ИначеЕсли Убрать.Количество() = 0 И Добавить.Количество() = 0 Тогда
		Части.Добавить(НСтр("ru = 'Уроков-планов с этой даты перевод не меняет — изменится только состав групп'"));
	Иначе
		Части.Добавить(
			СтрШаблон(НСтр(
			"ru = 'Уйдут из уроков-планов: %1, добавятся в уроки-планы: %2. Проведённые уроки не меняются'"),
			Убрать.Количество(), Добавить.Количество()));
	КонецЕсли;
	Для Каждого Предупреждение Из Итог.Предупреждения Цикл
		Части.Добавить(Предупреждение);
	КонецЦикла;
	СостояниеПлана = СтрСоединить(Части, Символы.ПС);
	Элементы.СостояниеПлана.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветПояснения();

КонецПроцедуры

#КонецОбласти
